src/Catalogs/СтатьиДвиженияДенежныхСредств/СтатьиДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДвиженияДенежныхСредств</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВозвратДенежныхСредствОтДругойОрганизации</name>
      <description>Возврат денежных средств от другой организации</description>
    </items>
    <items>
      <name>ВозвратДенежныхСредствОтПоставщика</name>
      <description>Возврат денежных средств от поставщика</description>
    </items>
    <items>
      <name>ВозвратОплатыКлиенту</name>
      <description>Возврат оплаты клиенту</description>
    </items>
    <items>
      <name>ВыдачаДенежныхСредствВДругуюКассу</name>
      <description>Выдача денежных средств в другую кассу</description>
    </items>
    <items>
      <name>ВыдачаДенежныхСредствВКассуККМ</name>
      <description>Выдача денежных средств в кассу ККМ</description>
    </items>
    <items>
      <name>ВыплатаЗаработнойПлаты</name>
      <description>Выплата заработной платы</description>
    </items>
    <items>
      <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
      <description>Оплата денежных средств в другую организацию</description>
    </items>
    <items>
      <name>ОплатаПоставщику</name>
      <description>Оплата поставщику</description>
    </items>
    <items>
      <name>ПеречислениеДенежныхСредствНаДругойСчет</name>
      <description>Перечисление денежных средств на другой счет</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствИзБанка</name>
      <description>Поступление денежных средств из банка (в гривнях)</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствИзБанкаВИностраннойВалюте</name>
      <description>Поступление денежных средств из банка (в иностранной валюте)</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
      <description>Поступление денежных средств из кассы ККМ</description>
    </items>
    <items>
      <name>ПоступлениеДенежныхСредствОтДругойОрганизации</name>
      <description>Поступление денежных средств от другой организации</description>
    </items>
    <items>
      <name>ПоступлениеОплатыОтКлиента</name>
      <description>Поступление оплаты от клиента</description>
    </items>
    <items>
      <name>КурсовыеРазницыПрибыль</name>
      <description>Прибыль от курсовых разниц</description>
    </items>
    <items>
      <name>СдачаДенежныхСредствВБанк</name>
      <description>Сдача денежных средств в банк (в гривнях)</description>
    </items>
    <items>
      <name>СдачаДенежныхСредствВБанкВИностраннойВалюте</name>
      <description>Сдача денежных средств в банк (в иностранной валюте)</description>
    </items>
    <items>
      <name>КурсовыеРазницыУбыток</name>
      <description>Убыток от курсовых разниц</description>
    </items>
  </predefined>
  <attributes>
    <name>КорреспондирующийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДвиженияДенежныхСредств</name>
    <type>
      <types>EnumRef.ВидыДвиженийДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ХозяйственныеОперации</name>
    <attributes>
      <name>ХозяйственнаяОперация</name>
      <type>
        <types>EnumRef.ХозяйственныеОперации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/СтатьиДвиженияДенежныхСредств/Forms/ФормаВыбораПоХозяйственнойОперации/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ХозяйственнаяОперация = Параметры.Отбор.ХозяйственнаяОперация;
	Параметры.Отбор.Удалить("ХозяйственнаяОперация");
	
	ШаблонЗаголовка = НСтр("ru='Выбор статьи ДДС для операции ""%1""';uk='Вибір статті РГК для операції ""%1""'");
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка, ХозяйственнаяОперация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокПоХозяйственнойОперации,
			"ХозяйственныеОперации.ХозяйственнаяОперация",
			ХозяйственнаяОперация,
			ВидСравненияКомпоновкиДанных.Равно,
			,
			Истина);
			
	РежимВыбора = "ПоХозОперации";
	Элементы.СписокПоХозяйственнойОперацииВыбрать.КнопкаПоУмолчанию = Истина;
	
	Если Не РольДоступна("ДобавлениеИзменениеКлассификаторовНастроекДДС") И Не РольДоступна("ПолныеПрава") Тогда
		Элементы.РежимВыбора.Видимость = Ложь;
		Элементы.СписокПоХозяйственнойОперацииСкрытьОтВыбора.Видимость = Ложь;
	КонецЕсли;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	
	ИспользованиеОтбора = ?(РежимВыбора = "ПоХозОперации", Истина, Ложь);
	
	Элементы.ГруппаСтраницыСписков.ТекущаяСтраница = ?(ИспользованиеОтбора,
		Элементы.СтраницаОтборпоХозОперации, Элементы.СтраницаВсе);
		
	Элементы.СписокПоХозяйственнойОперацииВыбрать.КнопкаПоУмолчанию = ИспользованиеОтбора;
	Элементы.СписокВсеВыбрать.КнопкаПоУмолчанию = НЕ ИспользованиеОтбора;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПоХозяйственнойОперацииВыборЗначения(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВсеВыборЗначения(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПривязатьХозОперациюКСтатьям(ВыбранноеЗначение, ХозяйственнаяОперация);
	Если ВыбранноеЗначение.Количество() > 1 Тогда
		РежимВыбора = "ПоХозОперации";
		Элементы.ГруппаСтраницыСписков.ТекущаяСтраница = Элементы.СтраницаОтборпоХозОперации;
	Иначе
		ОповеститьОВыборе(ВыбранноеЗначение[0]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкрытьОтВыбора(Команда)
	
	МассивСтатей = Элементы.СписокПоХозяйственнойОперации.ВыделенныеСтроки;
	МассивЗаблокированных = ПеренестиВоВсеСтатьиНаСервере(МассивСтатей, ХозяйственнаяОперация);
	
	Если МассивЗаблокированных.Количество() = 1 Тогда
		ШаблонТекстаОшибки = НСтр("ru='Не удалось перенести статью ДДС ""%1"".
                                    |Возможно статья ДДС редактируется другим пользователем.'
                                    |;uk='Не вдалося перенести статтю РГК ""%1"".
                                    |Можливо стаття РГК редагується іншим користувачем.'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, МассивЗаблокированных[0]);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
	ИначеЕсли МассивЗаблокированных.Количество() > 1 Тогда
		ТекстОшибки = НСтр("ru='Не удалось перенести несколько статей ДДС.
                                |Возможно статьи ДДС редактируются другими пользователями:'
                                |;uk='Не вдалося перенести кілька статей РГК.
                                |Можливо статті РГК редагуються іншими користувачами:'");
		Для Индекс = 0 По МассивЗаблокированных.ВГраница()-1 Цикл
			СтатьяДДС = МассивЗаблокированных[Индекс];
			ТекстОшибки = ТекстОшибки + Символы.ПС + 
							"   - " + СтатьяДДС + ";"
		КонецЦикла;
		ТекстОшибки = ТекстОшибки + Символы.ПС + 
			"   - " + МассивЗаблокированных[Индекс] + ".";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
	КонецЕсли;
	
	Элементы.СписокПоХозяйственнойОперации.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПеренестиВоВсеСтатьиНаСервере(МассивСтатейДДС, ХозяйственнаяОперация)
	
	МассивЗаблокированных = Новый Массив;
	
	Для Каждого СтатьяДДС Из МассивСтатейДДС Цикл		
		Попытка
			ЗаблокироватьДанныеДляРедактирования(СтатьяДДС);
		Исключение
			МассивЗаблокированных.Добавить(СтатьяДДС);
			Продолжить;
		КонецПопытки;
		СтатьяОбъект = СтатьяДДС.ПолучитьОбъект();
		СтатьяОбъект.ОбменДанными.Загрузка = Истина;
		СтрокаТабличнойЧасти = СтатьяОбъект.ХозяйственныеОперации.Найти(ХозяйственнаяОперация, "ХозяйственнаяОперация");
		Если СтрокаТабличнойЧасти <> Неопределено Тогда
			СтатьяОбъект.ХозяйственныеОперации.Удалить(СтрокаТабличнойЧасти);
			СтатьяОбъект.Записать();
		КонецЕсли;
		СтатьяОбъект.Разблокировать();
	КонецЦикла;
	
	Возврат МассивЗаблокированных;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПривязатьХозОперациюКСтатьям(МассивСтатейДДС, ХозяйственнаяОперация)
	
	Для Каждого СтатьяДДС ИЗ МассивСтатейДДС Цикл
		Попытка
			ЗаблокироватьДанныеДляРедактирования(СтатьяДДС);
		Исключение
			Продолжить;
		КонецПопытки;
		СтатьяОбъект = СтатьяДДС.ПолучитьОбъект();
		Если СтатьяОбъект.ХозяйственныеОперации.Найти(ХозяйственнаяОперация, "ХозяйственнаяОперация") = Неопределено Тогда
			СтатьяОбъект.ОбменДанными.Загрузка = Истина;
			СтатьяОбъект.ХозяйственныеОперации.Добавить().ХозяйственнаяОперация = ХозяйственнаяОперация;
			СтатьяОбъект.Записать();
			СтатьяОбъект.Разблокировать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВсеСоздать(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриЗакрытииВладельца, ЗначенияЗаполнения");
	ПараметрыФормы.ЗакрыватьПриЗакрытииВладельца = Истина;
	ПараметрыФормы.ЗначенияЗаполнения = Новый Структура("ХозяйственнаяОперация", ХозяйственнаяОперация);
	ОткрытьФорму("Справочник.СтатьиДвиженияДенежныхСредств.Форма.ФормаЭлемента", ПараметрыФормы, Элементы.СписокВсе);
	
КонецПроцедуры

#КонецОбласти
